// Menu.cpp

#include "Menu.h"

Menu::Menu() {}
Menu::Menu(EmployeeManager* ems, FileManager* file) {
	this->ems = ems;
	this->file = file;
}

void Menu::showMenu() {
	while (1) {
		int choice;
		cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
		cout << "\t\t\t   MENU " << endl;
		cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
		cout << "\t\t     Выберите вариант\n" << endl;
		cout << "\t1. Добавить сотрудника\n"
			<< "\t2. Добавить запись в табель рабочего времени\n"
			<< "\t3. Удалить всех сотрудников\n"
			<< "\t4. Удалить сотрудника по фамилии\n"
			<< "\t5. Показать информацию о сотрудниках\n"
			<< "\t6. Показать табель рабочего времени\n"
			<< "\t7. Сохранить данные в файл\n"
			<< "\t8. Загрузить данные из файла\n"
			<< "\t9. Найти информацию о сотруднике по коду\n"
			<< "\t10. Найти рабочее временя по коду сотрудника\n"
			<< "\t11. Выйти\n" << endl;
		cout << ">>> ";
		cin >> choice;

		switch (choice) {
		case 1: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\t  Добавить сотрудника " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			ems->add_employee();
			cout << endl;
			break;
		}
		case 2: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\t  Добавить запись в табель " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			ems->add_time();
			cout << endl;
			break;
		}
		case 3: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\t  Удалить всех сотрудников " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			ems->deleteAll();
			cout << endl;
			break;
		}
		case 4: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\tУдалить сотрудника по фамилии " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			string surname;
			cout << "Введите пожалуйста фамилию сотрудника: ";
			cin >> surname;
			Employee* empl = ems->deleteEmployeeBySurname(surname);
			cout << "Сотрудник " << surname << " успешно удален!" << endl;
			cout << endl;
			break;
		}
		case 5: {
			cout <<	"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "		Информация о сотрудниках " << endl;
			cout <<	"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			ems->printEmployee();
			cout << endl;
			break;
		}    
		case 6: {
			cout <<	"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "		Табель рабочего времени " << endl;
			cout <<	"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			ems->printTime();
			cout << endl;
			break;
		}
		case 7: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\t Сохраняем данные в файл..." << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			file->SaveToFile(ems);
			cout << endl;
			break;
		}
		case 8: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\t\t Загружаем данные из файла..." << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			file->LoadFromFile(ems);
			ems->printEmployee();
			ems->printTime();
			cout << endl;  
			break;
		}
		case 9: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\tНайти информацию о сотруднике по коду сотрудника " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			int code;
			cout << "Введите пожалуйста код сотрудника: ";
			cin >> code;
			cout << endl;
			Employee* empl = ems->findEmployeeByCode(code);
			if (empl != nullptr) {
				empl->print_employee();
			}
			else {
				cout << " Cотрудник с кодом = " << code << " не найден." << endl;
			}
			cout << endl;
			break;
		}
		case 10: {
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~" << endl;
			cout << "\tНайти информацию о рабочем времени по коду сотрудника " << endl;
			cout << "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n" << endl;
			int code;
			cout << "Введите пожалуйста код сотрудника: ";
			cin >> code;
			cout << endl;
			WorkTime* time = ems->findWorkTimeByEmployeeCode(code);
			if (time != nullptr) {
				cout << "Рабочее время сотрудника с кодом = " << code << " найдено." << endl;
			}
			else {
				cout << " Рабочее время сотрудника с кодом = " << code << " найдено." << endl;
			}
			cout << endl;
			break;
		}
		case 11: {
			return;
		}
		default: {
			cerr << "\n Вы выбрали неверный вариант!!!" << endl << endl;
			break;
		}
		}
	}
}
